Repository: layfellow/cpanel-cli
Catalog: doc/locale/*/LC_MESSAGES/reference/ftp.po
Languages: es

source: Module: ``ftp``
es: Módulo: ``ftp``

source: `Leer en español </es/latest/reference/ftp.html>`_
es: `Read in English </en/latest/reference/ftp.html>`_

source: **COMMANDS**
es: **COMANDOS**

source: Create a new FTP account using USER\@DOMAIN and PASSWORD. The DOMAIN must be a domain owned by your cPanel user. The newly created user will be allocated QUOTA megabytes of space; use ‘0’ for QUOTA to set an unlimited quota.
es: Crea una nueva cuenta FTP para el usuario USER\@DOMAIN y con contraseña PASSWORD. El dominio DOMAIN debe ser propiedad del usuario de cPanel. Al usuario recién creado se le asignan QUOTA megabytes de espacio en disco; utilice ‘0’ para QUOTA para establecer una cuota ilimitada.

source: Optionally, you can provide the FTP account’s home DIRECTORY to create. If you don’t provide a DIRECTORY, <DOMAIN>_ftp will be used. You can later change this using ‘cpanel set ftp dir’ (see below).
es: Opcionalmente, puede proporcionar el directorio inicial DIRECTORY de la cuenta FTP para crear. Si no se proporciona DIRECTORY, se usa uno de la forma <DOMAIN>_ftp.Posteriormente se puede cambiar este directorio inicial con ‘cpanel set ftp dir’ (vea más abajo).

source: Note that DIRECTORY is not an absolute path, but a path relative to the cPanel user’s remote login directory, i.e., /my_ftp corresponds to <remote login directory>/my_ftp.
es: Tenga en cuenta que DIRECTORY no es una ruta absoluta, sino que es relativa al directorio de inicio de sesión del usuario de cPanel, es decir, /my_ftp corresponde a <directorio de inicio de sesión>/my_ftp.

source: *Example*
es: *Ejemplo*

source: Access the account using an FTP client:
es: Puede acceder a la cuenta usando un cliente FTP:

source: FTP host: ftp.example.com
es: Servidor FTP: ftp.example.com

source: FTP username: scott@example.com
es: Usuario FTP: scott@example.com

source: FTP password: tiger
es: Contraseña FTP: tiger

source: Check whether the FTP account identified by USER\@DOMAIN exists. Return ‘OK’ if it exists, or an error if it doesn’t.
es: Comprueba si existe la cuenta FTP identificada por USER\@DOMAIN. Devuelve ‘OK’ si existe, o un error si no existe.

source: Get information about FTP account USER\@DOMAIN.
es: Obtiene información de la cuenta FTP USER\@DOMAIN.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list_ftp_with_disk/
es: Vea una muestra del resultado en formato JSON en:https://api.docs.cpanel.net/openapi/cpanel/operation/list_ftp_with_disk/

source: Return the disk quota in megabytes allocated to FTP USER\@DOMAIN, or ‘unlimited’ if it has no quota.
es: Devuelve la cuota de disco en megabytes asignados al usuario FTP USER\@DOMAIN, o ‘unlimited’ si no tiene cuota.

source: Set the disk quota in megabytes allocated to FTP USER\@DOMAIN; use ‘0’ for QUOTA to set an unlimited quota.
es: Establece la cuota de disco en megabytes para el usuario FTP USER\@DOMAIN; utilice ‘0’ para QUOTA para establecer una cuota ilimitada.

source: *Examples*
es: *Ejemplos*

source: Set the home DIRECTORY for FTP account USER\@DOMAIN. If DIRECTORY doesn’t exist, it is created.
es: Establece el directorio DIRECTORY inicial para la cuenta FTP USER\@DOMAIN. Si el directorio DIRECTORY no existe, se crea.

source: To get the current home directory for USER\@DOMAIN, use ‘cpanel get ftp’ (see above).
es: Para obtener el directorio de inicio actual de USER\@DOMAIN, utilice 'cpanel get ftp' (vea más arriba).

source: To list all the directories in cPanel user’s remote login directory, use ‘cpanel list files / | jq .[].fullpath’
es: Para listar todos los subdirectorios en el directorio de inicio de sesión remoto del usuario de cPanel, utilice ‘cpanel list files / | jq .[].fullpath’

source: Change the PASSWORD of FTP USER\@DOMAIN.
es: Cambia a PASSWORD la contraseña de usuario FTP USER\@DOMAIN.

source: List all the FTP accounts on the cPanel server, along with disk usage information and other data.
es: Lista todas las cuentas FTP en el servidor cPanel, junto con información del uso de disco y otros datos.

source: List the active FTP sessions.
es: Lista las sesiones de FTP activas.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list_sessions/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/list_sessions

source: Kill the active FTP session associated to USER\@DOMAIN. Use ‘cpanel list ftp sessions’ to list all active sessions. Use ‘all’ to kill all active sessions.
es: Elimina la sesión FTP activa asociada a USER\@DOMAIN. Utilice ‘cpanel list ftp sessions’ para listar todas las sesiones activas. Use ‘all’ para eliminar todas las sesiones activas.

source: Delete the FTP account identified by USER\@DOMAIN. Be advised that the USER’s FTP directory on the cPanel will also be deleted.
es: Eliminar la cuenta FTP identificada por USER\@DOMAIN. Tenga en cuenta que el directorio inicial del usuario FTP USER en cPanel también se elimina.

source: Return the FTP port open on the server.
es: Devuelve el puerto FTP abierto en el servidor.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_port/
es: Véase una muestra de los datos de resultados de JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_port

source: Return information about the FTP server software.
es: Devuelve información sobre el software del servidor FTP.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_ftp_daemon_info/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_ftp_daemon_info/

source: Enable anonymous FTP users to download files. If ‘incoming’ is passed, also enable the anonymous user to upload files.
es: Habilita la descarga de archivos para usuarios FTP anónimos. Si se pasa ‘incoming’, también permite a los usuarios anónimos subir archivos.

source: Assuming your cPanel domain is ‘example.com’, then an anonymous user can access your FTP server using the following (no password required):
es: Asumiendo que su dominio cPanel es ‘example.com’, entonces un usuario anónimo puede acceder a su servidor FTP utilizando lo siguiente (no se requiere contraseña):

source: FTP username: anonymous@example.com
es: Usuario FTP: anonymous@example.com

source: If ‘incoming’ is enabled, the anonymous user can also upload files to the /incoming directory.
es: Si ‘incoming’ está habilitado, un usuario anónimo también puede subir archivos al directorio /incoming.

source: For further information, see: https://docs.cpanel.net/cpanel/files/anonymous-ftp/
es: Para más información, vea: https://docs.cpanel.net/cpanel/files/anonymous-ftp/

source: Disable anonymous FTP users to download files. If ‘incoming’ is passed, also disable the anonymous user to upload files.
es: Deshabilita la descarga de archivos para usuarios anónimos de FTP. Si se pasa ‘incoming’, también deshabilita a los usuarios anónimos para subir archivos.

source: See ‘cpanel enable ftp anon’ above for further details.
es: Vea ‘cpanel enable ftp anon’ arriba para más detalles.

source: Return whether anonymous FTP users are allowed. If ‘incoming’ is passed, return whether the anonymous FTP user is allowed to upload files.
es: Devuelve si se permiten usuarios FTP anónimos. Si se pasa ‘incoming’, devuelve si se permite a los usuarios anónimos de FTP subir archivos.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/allows_anonymous_ftp/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/allows_anonymous_ftp/

source: Return the FTP welcome message for anonymous users.
es: Devuelve el mensaje de bienvenida de FTP para usuarios anónimos.

source: Set the FTP welcome message for anonymous users.
es: Establece el mensaje de bienvenida de FTP para usuarios anónimos.
