Repository: layfellow/cpanel-cli
Catalog: doc/locale/*/LC_MESSAGES/reference/mailman.po
Languages: es

source: Module: ``mailman``
es: Módulo: ``mailman``

source: `Leer en español </es/latest/reference/mailman.html>`_
es: `Read in English </en/latest/reference/mailman.html>`_

source: **COMMANDS**
es: **COMANDOS**

source: Create a new mailing list named LISTNAME for DOMAIN, using PASSWORD. By default, a mailing list is public, i.e, anyone can subscribe and read the archives. If ‘private’ is passed as an option, then make the mailing list private, so that subscriptions need to be approved by an administrator and only subscribed members can access the archives.
es: Crea una nueva lista de correos llamada LISTNAME para el dominio DOMAIN, con la contraseña PASSWORD. Por defecto, una lista de correo es pública, es decir, cualquiera puede suscribirse y leer los archivos. Si se pasa la opción ‘private’, entonces la lista de correos es privada, de modo que las suscripciones deben ser aprobadas por un administrador y sólo los miembros suscritos pueden acceder a los archivos.

source: Mailing lists are managed using the Mailman application. For further information on Mailman see https://wiki.list.org/DOC/Home
es: Las listas de correo se gestionan utilizando la aplicación Mailman. Para más información sobre Mailman véase https://wiki.list.org/DOC/Home

source: *Examples*
es: *Ejemplos*

source: Delete the mailing list identified by LISTNAME@DOMAIN.
es: Elimina la lista de correo identificada por LISTNAME@DOMAIN.

source: *Example*
es: *Ejemplo*

source: Count the number of mailing lists associated to your cPanel account.
es: Cuenta el número de listas de correo asociadas a la cuenta de cPanel.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/count_lists/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/count_lists

source: List the mailing lists of your cPanel account, along with detailed information of each mailing list.
es: Enumera las listas de correo de la cuenta de cPanel, junto con información detallada de cada lista.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list_lists/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/list_lists

source: Add one or more delegate EMAILS to the mailing list identified by LISTNAME@DOMAIN.
es: Agrega uno o más EMAILS de delegados a la lista de correo identificada por LISTNAME@DOMAIN.

source: A delegate is a subscriber to the mailing list with administrative privileges.
es: Un delegado es un suscriptor de la lista de correo con privilegios administrativos.

source: List the delegates of the mailing list identified by LISTNAME@DOMAIN.
es: Lista los delegados de la lista de correo identificada por LISTNAME@DOMAIN.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_mailman_delegates/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_mailman_delegates

source: Delete one or more delegate EMAILS from the mailing list identified by LISTNAME@DOMAIN.
es: Elimina uno o más EMAILS de delegados de la lista de correo identificada por LISTNAME@DOMAIN.

source: Return 1 if EMAIL is a delegate in any mailing list.
es: Devuelve 1 si EMAIL es un delegado en cualquier lista de correo.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/has_delegated_mailman_lists/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/has_delegated_mailman_lists

source: Generate a one-time password for the mailing list identified by LISTNAME@DOMAIN. This password will expire after one use.
es: Genera una contraseña única para la lista de correo identificada por LISTNAME@DOMAIN. Esta contraseña expira después de un uso.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/generate_mailman_otp/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/generate_mailman_otp

source: Set a new PASSWORD for the mailing list identified by LISTNAME@DOMAIN.
es: Establece un nueva contraseña PASSWORD para la lista de correo identificada por LISTNAME@DOMAIN.

source: Return the total disk usage of all mailing lists associated to your cPanel account.
es: Devuelve el uso total del disco de todas las listas de correo asociadas a la cuenta de cPanel.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_lists_total_disk_usage/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_lists_total_disk_usage

source: Make a mailing list identified by LISTNAME@DOMAIN private. In a a private mailing list subscriptions need to be approved by an administrator and only subscribed members can access the archives.
es: Vuelve privada la lista de correo identificada por LISTNAME@DOMAIN. En una lista de correo privada las suscripciones deben ser aprobadas por un administrador y sólo los miembros suscritos pueden accedera los archivos.

source: Make a mailing list identified by LISTNAME@DOMAIN public. In a public mailing list anyone can subscribe and archives are publicly accesible, even to non-subscribers.
es: Vuelve pública la lista de correo identificada por LISTNAME@DOMAIN. En una lista de correo pública cualquiera puede suscribirse y los archivos son accesibles públicamente, incluso a los no suscriptores.
