Repository: layfellow/cpanel-cli
Catalog: doc/locale/*/LC_MESSAGES/reference/mysql.po
Languages: es

source: Module: ``mysql``
es: Módulo: ``mysql``

source: `Leer en español </es/latest/reference/mysql.html>`_
es: `Read in English </en/latest/reference/mysql.html>`_

source: **COMMANDS**
es: **COMANDOS**

source: Create a new MySQL user with USERNAME and PASSWORD.
es: Crea un nuevo usuario de MySQL con nombre de usuario USERNAME y contraseña PASSWORD.

source: *Example*
es: *Ejemplo*

source: List all MySQL users associated to the cPanel account.
es: Lista todos los usuarios MySQL asociados a esta cuenta de cPanel.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/Mysql-list_users/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/Mysql-list_users/

source: Rename MySQL user from OLDUSERNAME to NEWUSERNAME.
es: Cambia el nombre de usuario de MySQL de OLDUSERNAME a NEWUSERNAME.

source: Change the password for MySQL user USERNAME to NEWPASSWORD.
es: Cambia la contraseña a NEWPASSWORD para el usuario de MySQL USERNAME.

source: Delete MySQL user USERNAME.
es: Elimina el usuario de MySQL USERNAME.

source: Create a new MySQL database with name DBNAME.
es: Crea una nueva base de datos MySQL con nombre DBNAME.

source: List existing MySQL databases.
es: Lista las bases de datos MySQL existentes.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list_databases/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/list_databases/

source: Rename MySQL database from OLDDBNAME to NEWDBNAME.
es: Cambia el nombre de la base de datos MySQL de OLDDBNAME a NEWDBNAME.

source: Delete MySQL database named DBNAME.
es: Elimina la base de datos MySQL DBNAME.

source: Check the integrity of MySQL database DBNAME.
es: Verifica la integridad de la base de datos de MySQL DBNAME.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/Mysql-check_database/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/Mysql-check_database/

source: Try to repair MySQL database DBNAME. See ‘cpanel check mysql database’ above.
es: Trata de reparar la base de datos de MySQL DBNAME. Vea ‘cpanel check mysql database’ arriba.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/repair_database/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/repair_database/

source: Set the privileges of MySQL user USERNAME on database DBNAME to PRIVILEGES.
es: Establece los privilegios del usuario de MySQL USERNAME en la base de datos DBNAME a PRIVILEGES.

source: To add full privileges, use 'ALL PRIVILEGES'. To add individual privileges, use a comma-separated list.
es: Para añadir privilegios completos, utilice 'ALL PRIVILEGES.' Para añadir privilegios individuales, utilice una lista separada por comas.

source: For a list of individual privileges see: https://api.docs.cpanel.net/openapi/cpanel/operation/set_privileges_on_database/
es: Vea la lista de privilegios individuales en: https://api.docs.cpanel.net/openapi/cpanel/operation/set_privileges_on_database/

source: For a description of the scope of individual privileges see: https://dev.mysql.com/doc/refman/8.0/en/privileges-provided.html
es: Para una descripción del alcance de los privilegios individuales vea: https://dev.mysql.com/doc/refman/8.0/en/privileges-provided.html

source: *Examples*
es: *Ejemplos*

source: List privileges granted to MySQL user USERNAME on database DBNAME.
es: Lista los privilegios concedidos al usuario de MySQL USERNAME en la base de datos DBNAME.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/Mysql-get_privileges_on_database/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/Mysql-get_privileges_on_database/

source: Revoke all privileges granted to MySQL user USERNAME on database DBNAME.
es: Revoca todos los privilegios otorgados al usuario de MySQL USERNAME en la base de datos DBNAME.

source: List routines (stored procedures and functions) associated to MySQL user USERNAME. If not provided, list routines from all users.
es: Lista las rutinas (procedimientos y funciones almacenadas) asociadas al usuario de MySQL USERNAME. Si no se proporciona el usuario, lista rutinas de todos los usuarios.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list_routines/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/list_routines/

source: Dump schema of MySQL database DBNAME. The schema is a SQL script that can later be used to recreate the database.
es: Descargas el esquema de la base de datos de MySQL DBNAME. El esquema es un script SQL que se puede utilizar para volver a crear la base de datos.

source: Add HOST to the list of authorized hosts that can connect to MySQL.
es: Añade HOST a la lista de hosts autorizados que pueden conectarse a MySQL.

source: HOST can be a hostname, an IP address, or a range with ‘%’ wildcards.
es: HOST puede ser un nombre de host, una dirección IP, o un rango con comodines ‘%’.

source: Add a short description NOTE to existing authorized host HOST. See ‘cpanel add mysql host’ above.
es: Añade una breve descripción NOTA al host autorizado HOST. Vea ‘cpanel add mysql host’ arriba.

source: List authorized hosts that can connect to MySQL. See ‘cpanel add mysql host’ above.
es: Lista los hosts autorizados que pueden conectarse a MySQL. Vea ‘cpanel add mysql host’ arriba.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_host_notes/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_host_notes/

source: Delete HOST from list of authorized. See ‘cpanel add mysql host’ above.
es: Elimina HOST de la lista de hosts autorizados. Vea ‘cpanel add mysql host’ arriba.

source: Return server information and version from MySQL.
es: Devuelve información del servidor y versión de MySQL.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_server_information/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_server_information/

source: Return MySQL object name length and prefix restrictions.
es: Devuelve las restricciones de longitud de nombre y prefijos para los objetos de MySQL.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_restrictions/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_restrictions/
