Repository: layfellow/cpanel-cli
Catalog: doc/locale/*/LC_MESSAGES/reference/postgres.po
Languages: es

source: Module: ``postgres``
es: Módulo: ``postgres``

source: `Leer en español </es/latest/reference/postgres.html>`_
es: `Read in English </en/latest/reference/postgres.html>`_

source: **COMMANDS**
es: **COMANDOS**

source: Create a new PostgreSQL user with USERNAME and PASSWORD.
es: Crea un nuevo usuario de PostgreSQL con nombre de usuario USERNAME y contraseña PASSWORD.

source: *Example*
es: *Ejemplo*

source: List all PostgreSQL users associated to the cPanel account.
es: Lista los usuarios de PostgreSQL asociados a la cuenta de cPanel.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/Postgresql::list_users/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/Postgresql::list_users/

source: Rename PostgreSQL user from OLDUSERNAME to NEWUSERNAME with NEWPASSWORD.
es: Camba el nombre de usuario PostgreSQL de OLDUSERNAME a NEWUSERNAME, con una nueva contraseña NEWPASSWORD.

source: Change the password for PostgreSQL user USERNAME to NEWPASSWORD.
es: Cambia la contraseña a NEWPASSWORD para el usuario de PostgreSQL USERNAME

source: Delete PostgreSQL user USERNAME.
es: Elimina el usuario de PostgreSQL USERNAME.

source: Create a new PostgreSQL database with name DBNAME.
es: Crea una nueva base de datos PostgreSQL con nombre DBNAME.

source: List existing PostgreSQL databases.
es: Lista las bases de datos PostgreSQL existentes.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/Postgresql-list_databases/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/Postgresql-list_databases/

source: Rename PostgreSQL database from OLDDBNAME to NEWDBNAME.
es: Cambia el nombre de la base de datos PostgreSQL de OLDDBNAME a NEWDBNAME.

source: Delete PostgreSQL database named DBNAME.
es: Elimina la base de datos PostgreSQL DBNAME.

source: Grant to PostgreSQL user USERNAME all privileges on database DBNAME. To manage user privileges, use GRANT/REVOKE statements. See: https://www.postgresql.org/docs/current/sql-grant.htm and https://www.postgresql.org/docs/current/sql-revoke.htm
es: Otorga todos los privilegios al usuario de PostgreSQL USERNAME en la base de datos DBNAME. Para gestionar los privilegios individuales, use GRANT/REVOKE. Vea: https://www.postgresql.org/docs/current/sql-grant.htm y https://www.postgresql.org/docs/current/sql-revoke.htm

source: Revoke all privileges granted to PostgreSQL user USERNAME on database DBNAME.
es: Revoca todos los privilegios otorgados al usuario de PostgreSQL USERNAME en la base de datos DBNAME.

source: Manually synchronize the user grants after adding users or tables to a PostgreSQL database. See ‘Add a PostgreSQL user’ at: https://docs.cpanel.net/cpanel/databases/postgresql-databases/ for further information.
es: Sincroniza manualmente los privilegios de usuarios de la base datos después de agregar usuarios o tablas a una base de datos PostgreSQL. Vea ‘Add a PostgreSQL user’ en: https://docs.cpanel.net/cpanel/databases/postgresql-databases/ para mayor información.

source: Return PostgreSQL object name length and prefix restrictions.
es: Devuelve las restricciones de longitud de nombre y prefijos para los objetos de PostgreSQL.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/Postgresql::get_restrictions/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/Postgresql::get_restrictions/
