Repository: layfellow/cpanel-cli
Catalog: doc/locale/*/LC_MESSAGES/reference/webmail.po
Languages: es

source: Module: ``webmail``
es: Módulo: ``webmail``

source: `Leer en español </es/latest/reference/webmail.html>`_
es: `Read in English </en/latest/reference/webmail.html>`_

source: ACCOUNT is the name of a cPanel email account, usually in the form user@domain.com
es: ACCOUNT es el nombre de una cuenta de correo de cPanel, usualmente de la forma user@domain.con

source: **COMMANDS**
es: **COMANDOS**

source: Return the settings for the Web Mail app used for ACCOUNT. If no ACCOUNT is provided, the default mail account is used.
es: Devuelve la configuración de la aplicación de Correo Web usada para la cuenta ACCOUNT. Si no se proporciona ACCOUNT, se usa la cuenta de correo por defecto.

source: *Examples*
es: *Ejemplos*

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_webmail_settings/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_webmail_settings/

source: Return a list of available Web Mail apps.
es: Devuelve una lista de aplicaciones de Correo Web disponibles.

source: *Example*
es: *Ejemplo*

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/listwebmailapps/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/listwebmailapps/
