Repository: layfellow/cpanel-cli
Catalog: doc/locale/*/LC_MESSAGES/contributing.po
Languages: es

source: How to contribute
es: Cómo contribuir

source: `Leer en español </es/stable/contributing.html>`_
es: `Read in English </en/stable/contributing.html>`_

source: To contribute, just fork this repository, make a new branch and open a `pull request`_.
es: Para contribuir, haga un fork de este repositorio, cree una nueva rama y abra un `pull request`_.

source: **cpanel-cli** is written in Python (version 3.11 or later required). I organized the code into a standard tree::
es: **cpanel-cli** está escrito en Python (versión 3.11 o posterior). El código está organizado en este árbol::

source: ``cpanel`` contains the main source code. Files ``REFERENCE`` and ``USAGE`` contain the actual text for the ``--help`` and ``--version`` flags and the ``help`` command. (I keep them in external files to make them easier to change. Also, I can automatically parse ``REFERENCE`` to generate ``*.rst`` files for the Sphinx documentation builder. See the ``reference.sh`` script below.)
es: ``cpanel`` contiene el código fuente principal. Los archivos ``REFERENCE`` y ``USAGE`` contienen el texto para las opciones ``--help`` y ``--version`` y el comando ``help``. (Los mantengo en archivos externos para que sea más fácil editarlos. Además, puedo analizar programáticamente ``REFERENCE`` para generar los archivos ``*.rst`` para el constructor de documentación Sphinx. Vea el script ``reference.sh`` más abajo).

source: Standard ``pyproject.toml`` contains the project metadata, development and release dependencies, and build backend definitions. (See `Writing your pyproject.toml`_ for further info.)
es: El archivo ``pyproject.toml`` estándar contiene los metadatos del proyecto, las dependencias de desarrollo y publicación, y las definiciones del backend de compilación. (Vea `Writing your pyproject.toml`_ para más información.)

source: I’m using the `Hatchling`_ build backend, with a small custom ``hatch.py`` script to get the ``dynamic`` metadata properties in ``pyproject.toml``. The custom ``hatch.py`` script works by parsing the ``cpanel/__init__.py`` source file.
es: Uso el backend de construcción `Hatchling`_, con un pequeño script personalizado ``hatch.py`` para obtener las propiedades de metadatos ``dynamic`` en ``pyproject.toml``. El script ``hatch.py`` funciona analizando el archivo fuente ``cpanel/__init__.py``.

source: ``pyrightconfig.json`` is the configuration file for the `Pyright`_ static type checker.
es: ``pyrightconfig.json`` es el archivo de configuración para el verificador de tipos estáticos `Pyright`_

source: ``test`` contains a set of unit API tests. They’re written using the `tox automation framework`_. The code driving the tests is in ``test/test_uapi.py``; the main tox configuration file is ``tox.ini``. These are *not* simple standalone unit tests, but API tests running against a *live* cPanel instance. See `Running tests`_ below for further details.
es: ``test`` contiene un conjunto de pruebas unitarias de la API. Están escritas usando el `framework de automatización tox`_. El código que controla las pruebas está en ``test/test_uapi.py``; el archivo de configuración principal de tox es ``tox.ini``. Nótese que *no* son simples pruebas unitarias independientes, sino pruebas de API que se ejecutan en una instancia de cPanel *activa*. Vea `Ejecución de pruebas`_ más abajo para más detalles.

source: ``doc`` contains the documentation sources, written in `reStructuredText`_ and processed using `Sphinx`_. The main configuration file for Sphinx is ``doc/conf.py``. The Sphinx version and theme used to build the documentation are in ``doc/requirements.txt``.
es: ``doc`` contiene las fuentes de la documentación, escritas en `reStructuredText`_ y procesadas con `Sphinx`_. El archivo de configuración principal de Sphinx es ``doc/conf.py``. La versión de Sphinx y el tema utilizado para construir la documentación están en ``doc/requirements.txt``.

source: The source files for the documentation are in ``doc/*.rst``. The ``index.rst`` file is the main page. You will notice a ``doc/reference`` folder and a series of ``*.rst`` files on it. These are programmatically generated by the ``reference.sh`` script and need *not* be edited manually. (I’m committing them to the source tree because they serve as the actual source files for Sphinx.)
es: Las fuentes de la documentación están en ``doc/*.rst``. El archivo ``index.rst`` es la página principal. Nótese una carpeta ``doc/reference`` y una serie de archivos ``*.rst`` en ésta. Éstos son generados programáticamente por el script ``reference.sh`` y *no* necesitan ser editados manualmente. (Los subo al repositorio porque Sphinx los usa como sus archivos fuentes).

source: The ``reference.sh`` script generates ``doc/reference.rst`` and the files inside ``doc/reference/`` by parsing the ``REFERENCE`` text file, splitting it into sections and converting them to restructuredText. This allows me to keep ``REFERENCE`` as a single source of truth for the documentation and keep the Sphinx documents up to date.
es: El script ``reference.sh`` genera ``doc/reference.rst`` y los archivos dentro de ``doc/reference/`` analizando el archivo de texto ``REFERENCE``, dividiéndolo en secciones y convirtiéndolas a restructuredText. Esto me permite mantener ``REFERENCE`` como una única fuente de verdad para la documentación y mantener los archivos de Sphinx actualizados.

source: ``_static`` contains the images and SVG files used in the documentation.
es: ``_static`` contiene las imágenes y archivos SVG utilizados en la documentación.

source: ``.readthedocs.yaml`` is a `configuration file for Read the Docs`_. The remote Sphinx build system uses this file.
es: ``.readthedocs.yaml`` es un `archivo de configuración para Read the Docs`_. El sistema remoto de construcción de Sphinx utiliza este archivo.

source: I maintain a Spanish translation of the documentation, generated using strings from a series of catalog files (``*.po``) inside ``locale/es/LC_MESSAGES/``. See `Translations`_ for further information.
es: También mantengo una traducción al español de la documentación, generada usando cadenas de una serie de archivos de catálogo (``*.po``) dentro de ``locale/es/LC_MESSAGES/``. Vea `Traducciones`_ para más información.

source: Finally, I’m using a ``Makefile`` to automate all phases of the development life cycle. (`Make and Makefiles are awesome`_.)
es: Finalmente, uso un ``Makefile`` para automatizar todas las fases del ciclo de vida del desarrollo. (`Make y los Makefiles son increíbles`_.)

source: Development environment
es: Entorno de desarrollo

source: I developed **cpanel-cli** on Ubuntu Linux 23.10 “Mantic” with Python 3.11. **cpanel-cli**, however, has no special requirements, so any Linux distro supporting at least Python 3.11 should work. You can also use macOS “Ventura” or a later macOS release.
es: **cpanel-cli** fue desarrollado en Ubuntu Linux 23.10 “Mantic” con Python 3.11. Sin embargo **cpanel-cli** no tiene ningún requerimiento especial, por lo que cualquier distribución de Linux que soporte al menos Python 3.11 debería funcionar. También puede utilizar macOS “Ventura” o posterior.

source: *To create a development environment on macOS*:
es: *Para crear un entorno de desarrollo en macOS*:

source: Install Python 3:
es: Instale Python 3:

source: Homebrew will install the latest Python version available. If you want to install a specific version, you can use the excellent `Pyenv`_ utility to manage different releases of Python side by side.
es: Homebrew instala la última versión de Python disponible. Si desea instalar una versión específica, puede usar el excelente utilitario `Pyenv`_ para gestionar diferentes versiones de Python en paralelo.

source: Install GNU Make:
es: Instale GNU Make:

source: *To create a development environment on Linux:*
es: *Para crear un entorno de desarrollo en Linux:*

source: On a Debian-based distro (Ubuntu, Mint), install Python 3 using:
es: Para distros basadas en Debian (Ubuntu, Mint), instale Python 3 con:

source: On a RPM-based distro (RHEL, Fedora), install Python 3 using:
es: Para distros basadas en RPM (RHEL, Fedora), instale Python 3 con:

source: ``apt`` and ``dnf`` will install the latest Python version available. If you want to install a specific version, you can use the excellent `Pyenv`_ utility to manage different releases of Python side by side.
es: ``apt`` y ``dnf`` instalan la última versión de Python disponible. Si quiere instalar una versión específica, puede usar el excelente utilitario `Pyenv`_ para gestionar diferentes versiones de Python.

source: GNU Make is installed by default on most Linux distros. Check its availability using:
es: GNU Make está instalado por defecto en la mayoría de las distros de Linux. Verifique su disponibilidad usando:

source: Building a local ``cpanel-cli`` package from source
es: Construcción del paquete ``cpanel-cli`` a partir del código fuente

source: Build and install a local ``cpanel-cli`` package:
es: Para construir e instalar un paquete local ``cpanel-cli`` use:

source: This will:
es: Lo anterior ejecuta lo siguiente:

source: Create a new virtual Python 3 environment in a ``venv`` directory
es: Crea un nuevo entorno virtual de Python 3 en un directorio ``venv``

source: Locally install in ``venv`` the development packages listed on the ``[project.optional-dependencies]`` section of ``pyproject.toml``
es: Instala en ``venv`` los paquetes de desarrollo listados en la sección ``[project.optional-dependencies]`` de ``pyproject.toml``

source: Build a local Python package ``cpanel-cli``
es: Construye un paquete local de ``cpanel-cli``

source: Running the local executable
es: Ejecución local

source: To run the executable, first activate the virtual environment (you need to run this only once per session):
es: Para ejecutar el paquete instalado localmente, primero active el entorno virtual (necesita ejecutar esto sólo una vez por sesión):

source: Then run the ``cpanel`` utility:
es: Luego ejecute el utilitario ``cpanel``:

source: If you edit the sources, just run ``pip3 install .`` (note the dot ``.``) to rebuild the local package.
es: Si edita las fuentes, simplemente ejecute ``pip3 install .`` (nótese el punto ``.``) para reconstruir el paquete local.

source: Running the (optional) type checker
es: Ejecución (opcional) del verificador de tipos

source: *Running the type checker is optional — you can ignore this step if you want.*
es: *El verificador de tipos es opcional; puede ignorar este paso si lo desea.*

source: The Python source code is annotated using type hints. I use them to improve the readability of Python code. Read the `Python Type Checking Guide`_ for an excellent introduction to the use of type hints in Python.
es: El código fuente de Python está anotado con sugerencias de tipos (*type hints*). Las uso hacer más legible el código. Lea la `Guía de verificación de tipos en Python`_ para una excelente introducción al uso de sugerencias de tipos en Python.

source: Type hints are not actually checked by the Python runtime — you need a third party *type checker* utility. For this project I use Pyright_, which is my Python type checker of choice.
es: Las sugerencias de tipos no son realmente verificadas por el runtime de Python; necesita un utilitario de un tercero. Para este proyecto uso Pyright_, que es mi verificador de tipos preferido para Python..

source: To install Pyright:
es: Para instalar Pyright:

source: Run it using:
es: Ejecútelo con:

source: The type checker configuration is in ``pyrightconfig.json``.
es: La configuración del verificador está en ``pyrightconfig.json``.

source: Note that Pyright is based on Node.js, so that pip will indirectly install it and pull a lot of JavaScript dependencies required by Pyright.
es: Tenga en cuenta que Pyright está basado en Node.js, por lo que pip instalará indirectamente Node.js y un montón de dependencias de JavaScript necesarias para Pyright.

source: Running tests
es: Ejecución de pruebas

source: I’m using the `tox automation framework`_ for a series of unit API tests. The main code driving the tests is in ``test/test_uapi.py``; the main tox configuration file is ``tox.ini``.
es: Para las pruebas unitarias del API uso el `framework de automatización tox`_. El código que controla las pruebas está en ``test/test_uapi.py``; el archivo de configuración principal de tox es ``tox.ini``.

source: These are *not* simple unit tests, but unit API tests running against a *live* cPanel instance. To run the tests, you need access to a cPanel instance running on another host reachable from the host you’re running the tests on.
es: Éstas *no* son pruebas unitarias simples, sino pruebas unitarias de API que se ejecutan contra una instancia `en vivo` de cPanel. Por esto, tox necesita acceso a una instancia de cPanel activa en algún host remoto accesible desde el host local

source: To set the remote hosts credentials, make a copy of the provided ``cpanelrc.test.example`` file and name it ``cpanelrc.test`` (keep in the ``test`` directory):
es: Para establecer las credenciales del host remoto, haga una copia del archivo proporcionado ``cpanelrc.test.example`` y cámbiele el nombre a ``cpanelrc.test`` (manténgalo en el directorio ``test``):

source: Then edit ``cpanelrc.test`` and set:
es: Luego edite ``cpanelrc.test`` y proporcione los siguientes datos:

source: The hostname of your cPanel instance
es: El nombre del host remoto de la instancia de cPanel

source: The username of your cPanel account
es: El nombre de usuario de su cuenta de cPanel

source: An `API token`_ associated to that username
es: Un `token de API`_ asociado a ese nombre de usuario.

source: **Token-based authentication is the only supported authentication method.**
es: **La autenticación basada en tokens es el único método de autenticación soportado.**

source: To run the tests, use:
es: Para ejecutar las pruebas, use:

source: The above command will hit the `cPanel UAPI REST interface`_ with most of the functions implemented in **cpanel-cli**.
es: El comando anterior accede a un subconjunto de la `interfaz REST de cPanel UAPI`_ con las funciones implementadas en **cpanel-cli**.

source: **The remote state of cPanel is left unchanged, i.e., the tests are strictly non-destructive.**
es: **El estado remoto de cPanel se deja sin cambios, es decir, las pruebas son estrictamente no destructivas.**

source: Packaging
es: Empaquetado

source: Packaging is done via the `Hatchling`_ build backend, as specified on the ``[build-system]`` section of ``pyproject.toml``.
es: El empaquetado se realiza a través del backend de construcción `Hatchling`_, como se especifica en la sección ``[build-system]`` de ``pyproject.toml``.

source: To run the packager, use:
es: Para ejecutar el empaquetador, use:

source: The above command should generate the following two distribution files in the temporary ``dist`` directory:
es: El comando anterior debería generar los siguientes dos archivos de distribución en el directorio temporal ``dist``:

source: where ``<version>`` is the release number set in ``cpanel/__init__.py``.
es: donde ``<versión>`` es el número de versión establecido en ``cpanel/__init__.py``.

source: The tarball is the source archive; the wheel file is the built distribution archive. The included files for these distribution packages are listed on the ``[tool.hatch.build.targets.sdist]`` and ``[tool.hatch.build.targets.wheel]`` sections of ``pyproject.toml`` respectively.
es: El archivo tar contiene el código fuente; el archivo wheel es el archivo de distribución binaria para instalación. Los archivos incluidos para estos paquetes de distribución están listados en las secciones ``[tool.hatch.build.targets.sdist]`` y ``[tool.hatch.build.targets.wheel]`` de ``pyproject.toml`` respectivamente.

source: These packages are ready to be uploaded to the `Python Package Index`_.
es: Estos paquetes están listos para ser subidos al `Python Package Index`_.

source: Building the documentation
es: Construcción de la documentación

source: The API documentation source files are in the ``doc`` directory. These comprise `reStructuredText`_ (``.rst``) files which are processed using `Sphinx`_ into groups of static HTML trees.
es: Los archivos fuente de la documentación de la API están en el directorio ``doc``. Estos comprenden archivos `reStructuredText`_ (``.rst``) que se procesan con `Sphinx`_ para generar árboles HTML estáticos.

source: To build the documentation, use:
es: Para construir la documentación utilice:

source: The above command will generate several static HTML trees in ``doc/build/html``. For example, it generates the default English documentation in ``doc/build/html/en`` — the start page is a conventional ``index.html`` file.
es: El comando anterior genera varios árboles HTML estáticos en ``doc/build/html``. Por ejemplo, la documentación por defecto en inglés se genera en ``doc/build/html/en``; la página de inicio es un archivo convencional ``index.html``.

source: This GitHub repository is currently connected to my `Read the Docs`_ account, so that any committed (or merged) change that updates the documentation sources will automatically trigger a remote Sphinx rebuild. The resulting updated HTML documentation will always be available at https://cpanel-cli.readthedocs.io/en/stable/
es: Este repositorio de GitHub está actualmente conectado a mi cuenta de `Read the Docs`_, de modo que cualquier cambio en un ``commit`` (o ``merge``) que actualice las fuentes de documentación dispara automáticamente una reconstrucción remota de Sphinx. La documentación HTML resultante está siempre disponible en https://cpanel-cli.readthedocs.io/es/stable/

source: The main configuration file for Sphinx is ``doc/conf.py``. The Sphinx version and theme used to build the documentation are in ``doc/requirements.txt``.
es: El archivo de configuración principal para Sphinx es ``doc/conf.py``. La versión de Sphinx y el tema usado para construir la documentación están en ``doc/requirements.txt``.

source: Translations
es: Traducciones

source: The English language ``*.rst`` files in ``doc`` are the source documentation files. Any translation is based on these documents. Translation is done on a string-by-string basis, using the original English string as a key (``msgid``), and the corresponding translated string as a value (``msgstr``). For example, for Spanish:
es: Los archivos ``.*rst`` en ``doc`` son las fuentes de los archivos de documentación. Todas las traducciones se basan en estos documentos. La traducción se realiza cadena por cadena, utilizando la cadena original en inglés como clave (``.msgid``), y la correspondiente cadena traducida como valor (``msgstr``). Por ejemplo, para español:

source: These ``msgid`` and ``msgstr`` pairs are kept in a *catalog* file (``*.po``), which is a simple text file. These catalog files are stored in the ``doc/locale`` subdirectory.
es: Estos pares ``msgid`` y ``msgstr`` se guardan en un archivo de *catálogo* (``.*po``), que es un archivo de texto simple. Estos archivos de catálogo se almacenan en el subdirectorio ``doc/locale.``

source: I personally maintain a Spanish translation of the documentation in catalog files ``doc/locale/es/LC_MESSAGES/*.po``.
es: La traducción al español de la documentación la mantengo personalmente en los archivos de catálogo ``.doc/locale/es/LC_MESSAGES/*.po``.

source: Catalog ``.po`` files are compiled into ``.mo`` files using the Sphinx internationalization utility. These compiled ``.mo`` files are later used to compose translated versions when `Building the documentation`_.
es: Los archivos ``.po`` de catálogo se compilan en archivos ``.mo`` con el utilitario de internacionalización de Sphinx. Estos archivos ``.mo`` compilados se utilizan luego para componer las versiones traducidas durante la `Construcción de la documentación`_.

source: Adding a translation
es: Cómo añadir una traducción

source: To add a new translation:
es: Para añadir una nueva traducción:

source: Create a new catalog using:
es: Cree un nuevo catálogo:

source: where ``<language code>`` is the `ISO 639-1 code`_ corresponding to the new language. For example, to add a French translation you would use:
es: donde ``<código de idioma>`` es el `código ISO 639-1`_ correspondiente al nuevo idioma. Por ejemplo, para añadir una traducción al francés se utilizaría:

source: This would add a new ``locale/fr/LC_MESSAGES/index.po`` directory with several ``.po`` files in it.
es: Este añadiría un nuevo directorio ``locale/fr/LC_MESSAGES`` con varios archivos ``.po``.

source: Edit the ``.po`` files created in step 1 and insert the translated strings as ``msgstr`` fields. For example:
es: Edite los archivos ``.po`` creado en el paso 1 e inserte las cadenas traducidas como campos ``msgstr``. Por ejemplo:

source: Rebuild the documentation:
es: Reconstruya la documentación:

source: The above command will create a new static HTML tree in ``doc/build/html/<language code>``. For example, for French, it will create a new tree in ``doc/build/html/fr``.
es: El comando anterior crea un nuevo árbol HTML estático en ``doc/build/html/<código de idioma>``. Por ejemplo, para el francés, crearía un nuevo árbol en ``doc/build/html/fr``.

source: Correcting and expanding an existing translation
es: Cómo corregir y ampliar una traducción existente

source: if you edit the original ``doc/*.rst`` source documentation files, you need to update the translations as well:
es: Si se edita el texto de los archivos de documentación originales ``doc/*.rst``, también hay que actualizar las traducciones:

source: Run the following to update the catalog files:
es: Ejecute lo siguiente para actualizar los catálogos:

source: where ``<language code>`` is the `ISO 639-1 code`_. You need to run it for every translated language.
es: donde ``<language code>`` es el código `ISO 639-1`_. Tiene que ejecutarlo para cada lenguaje traducido.

source: The previous step will emit a report telling you which ``.po`` files need to be updated, for example:
es: El paso anterior emite un informe con los archivos ``.po`` que necesitan ser actualizados, por ejemplo:

source: Open the mentioned ``.po`` files and edit or add new ``msgstr`` strings. Be advised that some entries might get annotated as ``#, fuzzy``, which means the internationalization engine is not sure if there already exists a translation for the entry because of similarities with another entry. Just edit the ``msgstr`` text and delete the ``fuzzy`` line.
es: Abra los archivos ``.po`` mencionados y edite o agregue nuevas cadenas ``msgstr``. Tenga en cuenta que algunas entradas pueden ser anotadas como ``#, fuzzy``, lo que significa que el motor de internacionalización no está seguro si ya existe una traducción para esa entrada debido a similitudes con otra entrada. Sólo se necesita editar el texto de ``msgstr`` y eliminar la línea ``fuzzy``.

source: For further information, see the `Internationalization Guide`_
es: Para más información consulte la `Guía de internacionalización`_.
