Repository: layfellow/cpanel-cli
Catalog: doc/locale/*/LC_MESSAGES/index.po
Languages: es

source: cPanel Command Line Interface
es: Interfaz de línea de comandos para cPanel

source: `Leer en español </es/stable/index.html>`_
es: `Read in English </en/stable/index.html>`_

source: A command line interface for the cPanel Unrestricted API.
es: Una interfaz de línea de comandos para la Unrestricted API de cPanel.

source: Swiftly execute commands in a terminal to manage a website, bypassing the need to log into `cPanel`_ and navigate through its web interface. This utility can also be seamlessly integrated into scripting tasks.
es: Ejecute comandos rápidamente en una terminal para gestionar un sitio web, evitando la necesidad de iniciar sesión en `cPanel`_ y navegar por su interfaz web. Este utilitario también se puede integrar sin problemas en tareas de scripting.

source: A portion of the cPanel UAPI (Unrestricted API) is implemented, enabling you to perform a wide array of functions with ease.
es: Se implementa una parte de la UAPI (API sin restricciones) de cPanel, lo que le permite realizar una amplia gama de funciones con facilidad.

source: Some examples:
es: Algunos ejemplos:

source: Create a backup of the account and store it in the remote user's home directory:
es: Crear una copia de seguridad de la cuenta y almacenarla en el directorio home del usuario remoto:

source: Directly write files to the remote user's home directory:
es: Escribir directamente archivos en el directorio home del usuario remoto:

source: Create a new FTP user with a quota and personal directory:
es: Crear un nuevo usuario FTP con una cuota y un directorio personal:

source: Create an email autoresponder:
es: Crear una respuesta automática de correo electrónico:

source: Set the cPanel user interface language to French:
es: Cambair a francés el idioma de la interfaz de usuario de cPanel:

source: List cPanel available features:
es: Listar las características disponibles de cPanel:

source: List cPanel email accounts:
es: Lista las cuentas de correo de cPanel:

source: And many more things. I intend to eventually fully cover the 500+ API functions available.
es: Y muchas cosas más. Con el tiempo espero cubrir completamente las más de 500 funciones disponibles en el API

source: The output is JSON, so it’s easily parsable using a `CLI JSON processor, like jq`_
es: La salida es JSON, por lo que es fácilmente analizable utilizando un `procesador CLI de JSON, como por ejemplo, jq`_

source: See the User’s `Guide`_ for a complete reference of the implemented API functions.
es: Consulte la `Guía del usuario`_ para una referencia completa de las funciones implementadas de la API.

source: Quick Start Guide
es: Guía rápida

source: **cpanel-cli** works on Linux and macOS (it might work on `Windows`_) and requires Python 3.11 or later.
es: **cpanel-cli** funciona en Linux y macOS (podría funcionar en `Windows`_) y requiere Python 3.11 o posterior.

source: For Linux, install Python 3.11 or later using your distro’s package manager.
es: Para Linux, instale Python 3.11 o posterior usando el gestor de paquetes de su distro.

source: For macOS, install Python 3.11 or later using Homebrew_.
es: Para macOS, instale Python 3.11 o posterior usando Homebrew_.

source: Create a ``.cpanelrc`` file in your ``$HOME`` directory with the following contents:
es: Cree un archivo ``.cpanelrc`` en su directorio ``$HOME`` con el siguiente contenido:

source: ``hostname`` is the hostname of your cPanel instance
es: ``hostname`` es el nombre de host de su instancia de cPanel

source: ``username`` is your username in your instance
es: ``username`` es su nombre de usuario en la instancia

source: ``utoken`` is an API token associated with ``username``. See `How to create an API token`_.
es: ``utoken`` es un token de API asociado con el ``username``. Lea `Cómo crear un token de API`_.

source: Then run:
es: Luego ejecute:

source: Test the installation using:
es: Pruebe la instalación usando:

source: For further instructions, see the `Installation`_ section of the User’s Guide.
es: Para mayores detalles, vea la sección de `Instalación`_ de la Guía del usuario.

source: User’s Guide
es: Guía del usuario

source: For developers
es: Para desarrolladores

source: License
es: Licencia

source: cPanel CLI
es: CLI para cPanel

source: `GNU General Public License v3 <https://www.gnu.org/licenses/gpl-3.0.en.html>`_
es: `GNU General Public License v3 <https://www.gnu.org/licenses/gpl-4.0.en.html>`_
