Repository: layfellow/cpanel-cli
Catalog: doc/locale/*/LC_MESSAGES/reference.po
Languages: es

source: Command Reference
es: Referencia de comandos

source: `Leer en español </es/latest/reference.html>`_
es: `Read in English </en/latest/reference.html>`_

source: Module: ``features``
es: Módulo: ``features``

source: List a cPanel account’s features.
es: Lista las características de una cuenta de cPanel. La salida está en formato JSON.

source: *Example*
es: *Ejemplo*

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list_features/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/list_features/

source: Module: ``quota``
es: Módulo: ``quota``

source: Get the cPanel account’s total disk quota information in megabytes.
es: Obtiene información de la cuota de disco total de la cuenta de cPanel en megabytes.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_quota_info/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_quota_info/

source: Module: ``usage``
es: Módulo: ``usage``

source: Show resource usage and some statistics, like bandwidth, number of subdomains, disk usage, number of mail filters, etc.
es: Muestra el uso de recursos y algunas estadísticas, como ancho de banda, número de subdominios, uso de disco, número de filtros de correo, etc.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_usages/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_usages/

source: Module: ``stats``
es: Módulo: ``stats``

source: Show detailed data and statistics, like hostname, file usage, database usage, dedicated IPs, etc.
es: Muestra datos y estadísticas detalladas, como el nombre de host, el uso de archivos, el uso de bases de datos, IPs dedicadas, etc.

source: STAT is the name of the statistic you want, you can provide a list of STATs to be displayed. For a complete list ot STAT names, see ‘display parameters’ at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_stats/
es: STAT es el nombre de la estadística que desea, se puede proporcionar una lista de STATs para mostrar. Para ver una lista completa de STATs, véase ‘display parameters’ en https://api.docs.cpanel.net/openapi/cpanel/operation/get_stats

source: *Examples*
es: *Ejemplos*

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_stats/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_stats/

source: Module: ``accounts``
es: Módulo: ``accounts``

source: List basic information of the main cPanel account.
es: Lista información básica de la cuenta principal de cPanel.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list_accounts/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/list_accounts/

source: Show detailed information of the main account.
es: Muestra información detallada de la cuenta principal.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/Variables-get_user_information/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/Variables-get_user_information/

source: Module: ``subaccounts``
es: Módulo: ``subaccounts``

source: List the sub-accounts of the main cPanel account, along with detailed information of each sub-account.
es: Lista las sub-cuentas de la cuenta principal de cPanel, junto con información detallada de cada sub-cuenta.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/UserManager-list_users/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/UserManager-list_users/

source: Show detailed information of a sub-account, identified by its GUID. To get this GUID, use ‘cpanel list subaccounts’. Note that only sub-accounts with a sub_account_exists flag set to 1 can be queried.
es: Muestra información detallada de una sub-cuenta, identificada por su GUID. Para obtener este GUID, use ``cpanel list subaccounts``. Tenga en cuenta que sólo sub-cuentas con un flag ``sub_account_exists`` establecido a 1 devuelven información.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/lookup_user/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/lookup_user/

source: Module: ``backup``
es: Módulo: ``backup``

source: **create backup home [EMAIL]**
es: **cpanel backup home [EMAIL]**

source: All ‘create backup’ commands create a backup tarball (a .tar.gz file) of the user’s home directory along with other account data, such as the crontab, API tokens, log files and DB data. The backup tarball’s name is backup-MM.DD.YYYY_HH-MM-SS_USERNAME.tar.gz.
es: Todos los comandos ``create backup`` crean un tarball de respaldo (un archivo ``tar.gz``) del directorio home del usuario junto con otros datos de la cuenta, como el crontab, tokens de API, archivos de log y bases de datos. El nombre del tarball de respaldo es ``backup-MM.DD.YYY_HH-MM-SS_USERNAME.tar.gz``.

source: If you pass an optional EMAIL argument, the backup engine will send a confirmation email after it completes the backup.
es: Si se pasa el argumento opcional EMAIL, el motor de respaldo envia un correo electrónico de confirmación después de que complete el respaldo.

source: Create a backup tarball and store it in the user’s home directory itself.
es: Crea un tarball de respaldo y lo almacena en el mismo directorio home del usuario.

source: Create a backup tarball and store it on a remote FTP server.
es: Crea un tarball de respaldo y lo almacena en un servidor FTP remoto.

source: HOST is the hostname of the remote FTP server. USERNAME and PASSWORD are the credentials to log in to it. Optional DIRECTORY is the destination directory on the remote server; by default use the remote user’s login directory. Note that DIRECTORY is not an absolute path, but a path relative to the login directory, i.e., /public corresponds to <remote login directory>/public.
es: HOST es el nombre de host del servidor FTP remoto. USERNAME y PASSWORD son las credenciales para acceder a éste. DIRECTORY (opcional) es el directorio de destino en el servidor remoto; por defecto se usa el directorio de inicio de sesión del usuario remoto. Tenga en cuenta que DIRECTORY no es una ruta absoluta, sino una ruta relativa al directorio de inicio de sesión, es decir, /public corresponde a <directorio de inicio remoto>/public.

source: Create a backup tarball and store it on a remote SCP server.
es: Crea un tarball de respaldo y lo almacena en un servidor SCP remoto.

source: USERNAME, PASSWORD, HOST and DIRECTORY are the same as for ‘create backup ftp’.
es: USERNAME, PASSWORD, HOST y DIRECTORY son los mismos que para ‘create backup ftp’.

source: List the account’s backup files.
es: Lista los archivos de respaldo de la cuenta.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list_backups/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/list_backups/

source: Module: ``cache``
es: Módulo: ``cache``

source: Create web browser cached file override ID.
es: Crea un ID de anulación de caché del navegador web.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/update/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/update/

source: Return web browser cached file override ID.
es: Devuelve el ID de anulación de caché del navegador web.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/CacheBuster-read/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/CacheBuster-read/

source: Module: ``locales``
es: Módulo: ``locale``

source: List all the available locales (language and conventions) for the cPanel user interface.
es: Lista todas las configuraciones regionales (idioma y convenciones) disponibles para la interfaz de usuario de cPanel.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list_locales/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/list_locales/

source: Return the current locale (language and conventions) used for the cPanel user interface.
es: Devuelve la configuración regional (idioma y convenciones) actual de la interfaz de usuario de cPanel.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_attributes/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_attributes/

source: Set the cPanel user interface locale (language and conventions) to LOCALE. Use ‘cpanel list locales’ for a list of available locales. In general terms, a LOCALE corresponds to a ISO 639-1 two-letter language code.
es: Establece la configuración regional (idioma y convenciones) de la interfaz de usuario de cPanel a LOCALE. Utilice ‘cpanel list locales’ para obtener una lista de los idiomas disponibles. En términos generales, un LOCALE corresponde a un código de idioma de dos letras ISO 639-1.

source: Module: ``styles``
es: Módulo: ``styles``

source: **set style NAME**
es: **get style NAME**

source: A style is a variation of a user interface theme for cPanel. For example, the ‘paper lantern’ theme has four styles: ‘basic’, ‘dark’, ‘light’ and ‘glass’.
es: Un estilo es una variación de un tema de interfaz de usuario para cPanel. Por ejemplo, el tema Paper Lantern tiene cuatro estilos: ‘basic’, ‘dark’, ‘light’ y ‘glass’.

source: Return all the available user interface styles.
es: Devuelve todos los estilos de interfaz de usuario disponibles.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/list/

source: Return the current user interface style.
es: Devuelve el estilo de interfaz de usuario actual.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/current/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/current/

source: Set the current user interface style to NAME. NAME must be one of ‘basic’, ‘dark’, ‘light’ or ‘glass’
es: Establece el estilo actual de la interfaz de usuario a NAME. NAME debe ser uno de los siguientes: ‘basic’, ‘dark’, ‘light’ o ‘glass’.

source: Set the default user interface style to NAME. NAME must be one of ‘basic’, ‘dark’, ‘light’ or ‘glass’
es: Establece el estilo por defecto de la interfaz de usuario a NAME. NAME debe ser uno de los siguientes: ‘basic’, ‘dark’, ‘light’ o ‘glass’.

source: Module: ``themes``
es: Módulo: ``themes``

source: A theme is a customized look and feel for the cPanel user interface. The default cPanel theme is ‘jupiter’; another popular theme is ‘paper lantern’.
es: Un tema es una apariencia personalizada para la interfaz de usuario de cPanel. El tema por defecto de cPanel es ‘jupiter’; otro tema popular es ‘paper lantern’.

source: Return all the available themes.
es: Devuelve todos los temas disponibles.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/Themes::list/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/Themes::list/

source: Return the current theme.
es: Devuelve el tema actual.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_theme_base/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_theme_base/

source: Set the current theme to NAME. NAME must be one the available themes reported by ‘cpanel list themes’.
es: Establece el tema actual a NAME. NAME debe ser uno de los temas disponibles según lo reporta ‘cpanel list themes’.

source: Module: ``dir``
es: Módulo: ``dir``

source: **INDEXING COMMANDS**
es: **COMANDOS DE INDEXACIÓN**

source: The indexing of a remote directory controls how to present that directory to a web browser if no default HTML index page is found.
es: La indexación de un directorio remoto controla cómo se presenta ese directorio a un navegador web si no se encuentra una página de índice HTML por defecto.

source: There are four possible index settings:
es: Hay cuatro posibles configuraciones de indexación:

source: ‘inherit’: Use the parent directory’s setting.
es: ‘inherit’: Utiliza la configuración del directorio padre.

source: ‘disabled’ (No Indexing): do not list the directory contents.
es: ‘disabled’: (No Indexing, *Sin indexación*), no lista el contenido del directorio.

source: ‘standard’ (Show Filename Only): list only the directory’s file names.
es: ‘standard’: (Show Filename Only, *Sólo mostrar nombre de archivo*), lista sólo los nombres de los archivos del directorio.

source: ‘fancy’: (Show Filename and Description) list the directory’s file names, sizes and types.
es: ‘fancy’: (Show Filename and Description, *Mostrar nombre de archivo y descripción*), lista los nombres, tamaños y tipos de archivos del directorio.

source: cPanel uses a .htaccess directive in the remote directory to control the index settings. For instance, for ‘fancy’, it adds the following to htaccess:
es: cPanel utiliza una directiva .htaccess en el directorio remoto para controlar la configuración de los índices. Por ejemplo, para ‘fancy’, añade lo siguiente a .htaccess:

source: See https://docs.cpanel.net/cpanel/advanced/indexes/ for further information.
es: Para más información, consulte https://docs.cpanel.net/cpanel/advanced/indexes/

source: Note that the PATH in all commands below is not absolute, but relative to the remote login directory, i.e., /public_html corresponds to <remote login directory>/public_html.
es: Tenga en cuenta que el PATH en todos los comandos siguientes no es absoluto, sino relativo al directorio de inicio de sesión, es decir, ``/public_html`` corresponde a <directorio de inicio de sesión>/public_html.

source: List the index settings for remote PATH and its subdirectories (children).
es: Listar la configuración de los índices del PATH remoto y sus subdirectorios (hijos).

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/DirectoryIndexes-list_directories/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/DirectoryIndexes-list_directories/

source: Get the index setting for remote PATH only.
es: Obtiene la configuración de índice sólo para el PATH remoto.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_indexing/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_indexing/

source: Set the index setting for remote PATH. Possible values for TYPE are ‘inherit’, ‘disabled’, ‘standard’ or ‘fancy’.
es: Establece la configuración de índice del PATH remoto. Los valores posibles para TYPE son ‘inherit’, ‘disabled’, ‘standard’ o ‘fancy’.

source: **PRIVACY COMMANDS**
es: **COMANDOS DE PRIVACIDAD**

source: cPanel can password-protect remote directories for privacy. Any attempt to access a private directory using a web browser will prompt for a username and password.
es: cPanel puede proteger con contraseña los directorios remotos para su privacidad. Cualquier intento de acceder a un directorio privado utilizando un navegador web solicitará un nombre de usuario y una contraseña.

source: The actual underlying authentication method is Basic HTTP authentication; these users and passwords are local to the directory, they are not cPanel users.
es: El método de autenticación subyacente es la autenticación básica HTTP; estos usuarios y contraseñas son locales para el directorio, no son usuarios de cPanel.

source: List the privacy settings for remote PATH and its subdirectories (children).
es: Lista la configuración de privacidad de PATH remoto y sus subdirectorios (hijos). La salida está enformato JSON.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/DirectoryPrivacy-list_directories/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/DirectoryPrivacy-list_directories/

source: Get the privacy settings for remote PATH only. You can enable or disable password protection using ‘cpanel enable dir privacy’ or ‘cpanel disable dir privacy’ (see below).
es: Obtiene la configuración de privacidad sólo para el PATH remoto. La salida está en formato JSON. Puede habilitar o deshabilitar la protección con contraseña usando ‘cpanel enable dir privacy’ o ‘cpanel disable dir privacy’ (vea más abajo).

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/is_directory_protected/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/is_directory_protected/

source: Enable password protection for PATH. Note that you need to add users using ‘cpanel add dir user’ (see below) to grant access to PATH.
es: Habilita la protección con contraseña para PATH. Tenga en cuenta que necesita agregar usuarios usando ``cpanel add dir user`` (vea más abajo) para otorgar acceso al PATH.

source: Disable password protection for PATH.
es: Desactiva la protección con contraseña para PATH.

source: **USER MANAGEMENT COMMANDS**
es: **COMANDOS DE GESTIÓN DE USUARIOS**

source: cPanel grants access to remote password-protected directories using ad hoc users and passwords specific to every directory. Use the commands below to manage these users.
es: cPanel permite el acceso a directorios remotos protegidos por contraseña utilizando usuarios y contraseñas específicas para cada directorio. Utilice los comandos siguientes para gestionar estos usuarios.

source: cPanel stores the credentials in a .htpasswd file. See https://en.wikipedia.org/wiki/.htpasswd for further information.
es: cPanel almacena las credenciales en un archivo .htpasswd. Consulte https://en.wikipedia.org/wiki/.htpasswd para más información.

source: Add USER with corresponding PASSWORD to the list of allowed users for PATH.
es: Añade el usuario USER con su correspondiente contraseña PASSWORD a la lista de usuarios permitidos para PATH.

source: Remove USER from the list of allowed users for PATH.
es: Elimina USER de la lista de usuarios permitidos para PATH.

source: List allowed users for PATH.
es: Lista los usuarios permitidos para PATH.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/DirectoryPrivacy::list_users/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/DirectoryPrivacy::list_users/

source: **LEECH PROTECTION COMMANDS**
es: **COMANDOS DE PROTECCIÓN CONTRA ABUSOS**

source: Leech protection adds some basic measures against the abuse of password-protected directories. The system allows a maximum number of logins per hour for a leech-protected directory.
es: La protección contra abusos (*leech*) añade algunas medidas básicas contra el uso excesivo de directorios protegidos por contraseña. El sistema sólo permite un número máximo de inicios de sesión por hora para un directorio protegido contra abusos (*leech*).

source: See https://docs.cpanel.net/cpanel/security/leech-protection/ for further information.
es: Consulte https://docs.cpanel.net/cpanel/security/leech-protection/ para obtener más información.

source: 033[1mlist dir protection PATH033[00m List leech protection status for PATH and its subdirectories (children).
es: Lista el estado de la protección contra abusos para PATH y sus subdirectorios (hijos).

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/DirectoryProtection-list_directories/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/DirectoryProtection-list_directories/

source: Module: ``dns``
es: Módulo: ``dns``

source: Check if DOMAIN resolves to the cPanel server.
es: Comprueba si DOMAIN resuelve hacia este servidor de cPanel.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/ensure_domains_reside_only_locally/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/ensure_domains_reside_only_locally/

source: Tell if cPanel server is the authoritative server for DOMAIN.
es: Indica si el servidor de cPanel es el servidor DNS con autoridad para DOMAIN.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/has_local_authority/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/has_local_authority/

source: Return DNS zone information about DOMAIN.
es: Devuelve información de la zona DNS de DOMAIN.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/dns-lookup/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/dns-lookup/

source: List the Dynamic DNS domains for your cPanel user.
es: Lista los dominios DNS dinámicos para el usuario de cPanel.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/dynamicdns-list/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/dynamicdns-list/

source: Create a new Dynamic DNS entry attached to SUBDOMAIN. Optionally include a human-readable DESCRIPTION. Return an ID which you can later use in a web call https://example.com/cpanelwebcall/<ID>.
es: Cree una nueva entrada DNS dinámica adjunta a SUBDOMAIN. Opcionalmente incluye una DESCRIPTION legible Devuelve un ID que más tarde puede utilizar en una llamada web https://example.com/cpanelwebcall/<ID>

source: For further information see: https://docs.cpanel.net/cpanel/domains/dynamic-dns/
es: Para más información véase: https://docs.cpanel.net/cpanel/domains/dynamic-dns

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/dynamicdns-create/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/dynamicdns-create/

source: Delete and create again a Dynamic DNS entry identified by ID. Return a new ID. Use ‘cpanel list dynamic dns’ to get a list of IDs and associated subdomains.
es: Elimina y crea de nuevo una entrada DNS dinámica identificada por ID. Devuelve una nueva ID. Use ‘cpanel list dinamyc dns’ para obtener una lista de IDs y subdominios asociados.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/dynamicdns-recreate/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/dynamicdns-recreate/

source: Update the DESCRIPTION of Dynamic DNS entry identified by ID.
es: Actualiza la descripción de la entrada DNS dinámica identificada por ID a DESCRIPTION.
