Repository: layfellow/cpanel-cli
Catalog: doc/locale/*/LC_MESSAGES/reference.po
Languages: es

source: Delete a Dynamic DNS entry identified by ID. Use ‘cpanel list dynamic dns’ to get a list of IDs and associated subdomains.
es: Elimina una entrada DNS dinámica identificada por su ID. Use ‘cpanel list dinamyc dns’ para obtener una lista de IDs y subdominios asociados.

source: Module: ``domains``
es: Módulo: ``domains``

source: List domains for the cPanel account’s.
es: Lista los dominios de esta cuenta de cPanel.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list_domains/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/list_domains/

source: Get hosting data for all the cPanel account’s domains.
es: Obtiene los datos de hosting para todos los dominios de esta cuenta de cPanel.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/domains_data/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/domains_data/

source: Get hosting data for DOMAIN. Use ‘cpanel list domains’ to get a list of domains.
es: Obtiene los datos de hosting para el dominio DOMAIN. Use ‘cpanel list domains’ para obtener una lista de dominios.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/single_domain_data/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/single_domain_data/

source: List the built-in subdomain aliases for an account’s main domain.
es: Lista los alias de los subdominios incorporados para el dominio principal de esta cuenta.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/main_domain_builtin_subdomain_aliases/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/main_domain_builtin_subdomain_aliases/

source: Module: ``log``
es: Módulo: ``log``

source: cPanel log archival settings are:
es: Los parámetros para archivar los logs de cPanel son:

source: If ‘archive’ is set, log files will be archived to your home directory after the system processes statistics.
es: Si se establece ‘archive’, los logs serán archivados en su directorio home después de que el sisteme procese las estadísticas.

source: If ‘prune’ is set, cPanel will remove the previous month’s archived logs at the end of every month.
es: Si se establece ‘prune’, cPanel eliminará los logs archivados del mes anterior al final de cada mes.

source: Get the account’s log archival settings.
es: Obtiene los parámetros para archivar logs de la cuenta.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_settings/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_settings/

source: Set the account’s log archival settings. SETTING is ‘archive’ or ‘prune’.
es: Activa los parámetros para archivar los logs de la cuenta. SETTING es ‘archive’ o ‘prune’.

source: Unset the account’s log archival settings. SETTING is ‘archive’ or ‘prune’.
es: Desactiva los parámetros para archivar los logs de la cuenta. SETTING es ‘archive’ o ‘prune’.

source: List the account’s archived log files.
es: Lista los logs archivados de la cuenta.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list_archives/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/list_archives/

source: Module: ``bandwidth``
es: Módulo: ``bandwidth``

source: For further information see: https://docs.cpanel.net/cpanel/metrics/bandwidth/
es: Para más información véase: https://docs.cpanel.net/cpanel/metrics/bandwidth/

source: Return a list of services (by protocol) being monitored in bandwidth data.
es: Devuelve una lista de servicios (por protocolo) cuyo uso de ancho de banda es monitoreado.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_enabled_protocols/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_enabled_protocols/

source: Get the collection interval and retention periods for bandwidth data.
es: Obtiene el intervalo de recolección y los períodos de retención para datos de ancho de banda.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_retention_periods/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_retention_periods/

source: Module: ``files``
es: Módulo: ``files``

source: Arguments:
es: Argumentos:

source: Optional DIRECTORY is a remote directory
es: El argumento opcional DIRECTORY es un directorio remoto

source: PATH can refer to either a remote directory or a remote file
es: PATH puede referirse a un directorio remoto o a un archivo remoto

source: PARTIALPATH is an incomplete remote PATH
es: PARTIALPATH es un PATH remoto incompleto

source: FILE is a remote file
es: FILE es un archivo remoto

source: LOCALFILE is a local file
es: LOCALFILE es un archivo local

source: Use ‘/’ to separate subdirectory components in DIRECTORY, PATH, PARTIALPATH or FILE. For example, a DIRECTORY could be public_html/images or a PATH could be public_ftp/.htacccess.
es: Utilice ‘/’ para separar componentes de subdirectorio en DIRECTORY, PATH, PARTIALPATH o FILE. Por ejemplo, un DIRECTORY podría ser public_html/images o un PATH podría ser public_ftp/.htacccess

source: All the remote arguments are relative to the remote user’s login directory, e.g., public corresponds to <remote login directory>/public.
es: Todos los argumentos remotos son relativos al directorio de inicio de sesión del usuario, por ejemplo, public corresponde a <directorio de inicio de sesión remoto>/public.

source: Return a list of files and subdirectories in DIRECTORY
es: Devuelve una lista de los archivos y subdirectorios del directorio DIRECTORY

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list_files/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/list_files/

source: Return a list of files and subdirectories whose names start with PARTIALPATH. For instance, /public matches /public_html and /public_ftp.
es: Devuelve una lista de archivos y subdirectorios cuyos nombres comienzan con PARTIALPATH. Por ejemplo, /public hace referencia a /public_html y /public_ftp.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/autocompletedir/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/autocompletedir/

source: Return file information about PATH.
es: Devuelve información del archivo o directorio PATH.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_file_information/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_file_information/

source: Return the contents of FILE. Note that only UTF-8 encoded files are supported.
es: Devuelve el contenido de FILE. Tenga en cuenta que sólo los archivos codificados en UTF-8 son compatibles con este comando.

source: Write CONTENTS as a remote text FILE. Note that only UTF-8 encoded content is supported. Escape codes, such as ``\n``, ``\t`` and others, are supported.
es: Escribe CONTENTS como un archivo remoto FILE. Tenga en cuenta que sólo texto codificado en UTF-8 es compatible. Se aceptan códigos de escape, como ``\n``, ``\t`` y otros.

source: Upload a LOCALFILE to remote DIRECTORY . If the remote DIRECTORY doesn’t exist, it will be created.
es: Carga un archivo local LOCALFILE al directorio remoto DIRECTORY. Si el directorio remoto DIRECTORY no existe, se crea.

source: Delete the contents of the .trash directory in the user’s home. Optional DAYS will only delete files older than DAYS days. By default, all files are deleted.
es: Elimina el contenido del directorio .trash en el home remoto del usuario. El argumento opcional DAYS indica que sólo se eliminen archivos más antiguos a DAYS días. Por defecto, todos los archivos se eliminan.

source: Module: ``mail``
es: Módulo: ``mail``

source: List cPanel email accounts.
es: Lista las cuentas de correo.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list_pops/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/list_pops/

source: List mail filters associated to ACCOUNT. Output is a JSON-formatted array of filter names. ACCOUNT is the name of a cPanel email account, usually user@domain
es: Lista los filtros de correo asociados a ACCOUNT. La salida es una serie de nombres de filtros en formato JSON.

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/list_filters/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/list_filters/

source: Return a JSON-formatted description of email filter FILTERNAME associated to email ACCOUNT. To get a list of current filter names, use ‘cpanel list mail filters ACCOUNT’
es: Devuelve una descripción en formato JSON del filtro de correo electrónico FILTERNAME asociado al correo ACCOUNT. Para obtener una lista de nombres de filtros actuales, use ‘cpanel list mail filters ACCOUNT’

source: See a sample of the JSON result data at: https://api.docs.cpanel.net/openapi/cpanel/operation/get_filter/
es: Vea una muestra del resultado en formato JSON en: https://api.docs.cpanel.net/openapi/cpanel/operation/get_filter/

source: Create or update an email filter associated with email ACCOUNT. If the filter already exists, it updates it; otherwise, it creates a new filter. Use a JSON FILE to describe the filter rules. This JSON FILE has the same textual format as the output from ‘cpanel get mail filter’, so the easiest way to create a new filter is to dump an existing filter into a filter.json file, edit it and then upload it with ‘cpanel set mail filter’. See the EXAMPLE below.
es: Crea o actualiza un filtro de correo electrónico asociado con el correo ACCOUNT. Si el filtro ya existe, lo actualiza; de lo contrario, crea un nuevo filtro. Utilice un JSON FILE para describir las reglas del filtro. Este JSON FILE tiene el mismo formato textual que la salida de ‘cpanel get mail filter’, por lo que la forma más fácil de crear un nuevo filtro es descargar un filtro existente a un archivo ‘filter.json’, editarlo y luego cargarlo con ‘cpanel set mail filter’. Vea el ejemplo a continuación.

source: Delete email filter FILTERNAME associated to ACCOUNT. To get a list of current filter names, use ‘cpanel list mail filters ACCOUNT’
es: Elimina el filtro de correo FILTERNAME asociado a ACCOUNT. Para obtener una lista de nombres de filtros actuales, utilice ‘cpanel list mail filters ACCOUNT’
